<!doctype html>
<html lang="fr">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>
<?php

    function pyramideFacil($nombre,$lettre){
        echo "<table>";
        for ($i=1;$i<=$nombre;$i++){
            echo"<tr>";
            for ($j=0;$j<$i;$j++){
                echo "<td><pre>$lettre</pre></td>";
            }
            echo "</tr>";
        }
        echo "</table>";
    }

    function pyramideDur($nombre,$lettre){
        echo "<table>";
        for ($i=1;$i<=$nombre;$i++){
            echo"<tr>";
            //case vide
            for ($j=0;$j<$nombre-$i;$j++){
                echo "<td></td>";
            }
            echo "<td><pre>$lettre</pre></td>";
            for ($j=0;$j<$i-1;$j++){
                echo "<td></td>";
                echo "<td><pre>$lettre</pre></td>";
            }

            echo "</tr>";

        }
        echo "</table>";
    }

    //récupération du nombre d'atges présent dans un get
    //ancienne méthode
    //$etages=$_GET["etages"];
    //nouvelle méthode plus sécurisé
    $etages=filter_input(INPUT_GET,"etages");

    pyramideFacil($etages,"           _  .   .   .
         .' '; '-' '-'|-.
        (     '------.'  )
         ;            \ /
          :     '   ' |/
          '._._       \    .;
         .-'   ;--.    '--' /
        /      \-'---.___.'
       |     / 7 \(>o<) /\
       |     | \ |  . \   \
       |=====|   |  .  \ |-)
        |-'-'   ./_.O._.\|\"
        '-.----'        |
          |       |     |
          |     | |   | |
          |_____|_|___|_|
           (-------',----'.
           '-'-----'-----'");
    echo "<hr>";
    pyramideFacil($etages,"
                   ++++++++++++ 
                ++++++++++++++++++ 
              ++++++++++++++++++++++ 
             ++++++++++++++++++++++++ + ++++ 
            ++++++++++++++++++++++++ +++ ++++++ 
            ++++++++++++++++++++++++++++++++++++ 
             ++++++++++++++++++++++++++++++++++++ 
             :::::::::,a@@a,:::::,a@a,++++++++++. 
        .ooOOOOOOOOOOo@@@@@@oOoOo@@@@@,++++++++/:. 
     o OOOOOOOOOOOOo@@@@@@@@@oOOo@@@@@@,++++++/::: 
  o oOOOOOOOOOOOOOo@@@@@@@@@@@oOo@@@@@@a  '::::::: 
 oOoOOOOOOOOOOOOOOo@@@@@@@@@@@oOo@@@@@@@   ::::::: 
oOOOOOOOOOOOOOOOOo@@@@@@@@@@@@oOo@@@@@@@   ::: ::' 
oOOOOOOOOOOOOOOOOo`  '@@@@@@@@oOo` '@@@@  ,:'  ' 
oOOOOOOO%%%%%OOOOo    @@@@@@@@oOo   @@@a 
 oOOOO;%%%.%%%OOOo.  ,@@@@@@@oOOo. ,@@@' 
  oOOO%%%.%%%%%OOOoa@@@@@@@@oOOOo@@@@@' 
   OOO%%%.%%%%%%OOo@@@@@@@@oOOOOOo@@@'        .,;%%%%%;. 
    OOO%%.%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%//%%%%%%%%% 
      OO%%.%%%%%%%%%%%%%%%%;%%%%%%%%%%%%%%//%%%%%%%%%%%; 
        O%%.....';%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%;' 
          %%.............%%%%%%%%%%%%%%%%%%%%%%%;' 
           %%............`%%,   \"\"\"\"\"\"\"\"\"\"\"\"\" 
            %%............%%; 
             %%...........%%; 
              %%%%%%%%%%%%%; 
               `%%%%%%%%%;'");
    echo "<hr>";
    pyramideDur($etages,"              .--------------------.
 _____________|  \  |  _ \ __|  __|| ..-----.   _________________
 _____________| |\/ | (   |_| \__ \.'        `. _________________|
              |_|  _|\___/___|____/    __.,,._/                  |
              '----------------- |   .'.-. .-.      _            |
  ________       _____________   '.  ( \o; \o; _ .'` `-. ___     |
  -------.|     |.-----------.|    `._   ._. /--'._,_.,' --.|    |
 /\ /\ /\||     ||     _..-'|||      ,'`-...' \ /\|||||` /\||    |
 \/ \/ \/||     ||    |     |||   ,-' \/  \/. / \/||' |/ \/||    |
 /\ /\ /\||     ||    | .-. |||  /  .    |   '. . '---'\ /\||    |
 \/ \/ \/||     ||    | | | |||  |  '     \  . '   /  \/ \/||    |
 /\ /\ /\||     ||====| '-' |||  |  ;     |   \._.'/\ /\ /\||    |
 \/_\/_\/||     || .==|     |||  |  |     ;   |_\/_\/_\/_\/||    |
 ---------'     ||  |||     |||  |  /``-.__..'--------------'    |
                ||  |||     |||   './,|     \                    |
                ||    |     |||    |-`      |                    |
                ||    '--.._|||    \    |   |                    |
 ---------------''-----------''---- |   |   |--------------------'
                                    |   |   |
                                    |   |   |
 :::::::::::::::::::::::::::::::::: |   |   |::::::::::::::::::::::
                                    ;   |--''.                LGB
                                   /'--''-..__)
                                   `..--.__)");
    echo "<hr>";
    pyramideDur($etages,"
   __&__      
  /     \     
 |       |    
 |  (o)(o)    
 C   .---_)   
  | |.___|    
  |  \__/     
  /_____\     
 /_____/ \    
/         \ ");

?>
</body>
</html>